import re

print(
    """
    *********************************************************************
                         企业编码管理系统
    *********************************************************************
          1、生成6位数字防伪编码
          2、生成9位数字防伪编码
          0、退出系统
    =====================================================================
    说明：通过数字键或方向键←↑→↓选择菜单
    =====================================================================
    """
)
option_str = input("请通过数字键或方向键←↑→↓选择菜单：")
option = re.sub("\D", "", option_str)

if int(option) == 1:
    print("生成6位数字防伪编码")
if int(option) == 2:
    print("生成9位数字防伪编码")
if int(option) == 0:
    print("退出系统")